ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437zx.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief HICK Auto Clock Calibration (ACC)
  */

typedef struct
{                                                   /*!< ACC Structure                                                         */
  __IO uint32_t  STS;                               /*!< status register                                                       */
  __IO uint32_t  CTRL1;                             /*!< control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< control register 2                                                    */
  __IO uint32_t  CC1;                               /*!< compare value 1                                                       */
  __IO uint32_t  CC2;                               /*!< compare value 2                                                       */
  __IO uint32_t  CC3;                               /*!< compare value 3                                                       */
} ACC_TypeDef;

/**
  * @brief Analog to digital converter (ADC)
  */

typedef struct
{                                                   /*!< ADC Structure                                                         */
  __IO uint32_t  STS;                               /*!< status register                                                       */
  __IO uint32_t  CTRL1;                             /*!< control register 1                                                    */
  __IO uint32_t  CTRL2;                             /*!< control register 2                                                    */
  __IO uint32_t  SPT1;                              /*!< sample time register 1                                                */
  __IO uint32_t  SPT2;                              /*!< sample time register 2                                                */
  __IO uint32_t  PCDTO1;                            /*!< Preempted channel 1 data offset register                              */
  __IO uint32_t  PCDTO2;                            /*!< Preempted channel 2 data offset register                              */
  __IO uint32_t  PCDTO3;                            /*!< Preempted channel 3 data offset register                              */
  __IO uint32_t  PCDTO4;                            /*!< Preempted channel 4 data offset register                              */
  __IO uint32_t  VMHB;                              /*!< Voltage monitoring high boundary register                             */
  __IO uint32_t  VMLB;                              /*!< Voltage monitoring low boundary register                              */
  __IO uint32_t  OSQ1;                              /*!< Ordinary sequence register 1                                          */
  __IO uint32_t  OSQ2;                              /*!< Ordinary sequence register 2                                          */
  __IO uint32_t  OSQ3;                              /*!< Ordinary sequence register 3                                          */
  __IO uint32_t  PSQ;                               /*!< Preempted sequence register                                           */
  __IO uint32_t  PDT1;                              /*!< Preempted data register 1                                             */
  __IO uint32_t  PDT2;                              /*!< Preempted data register 2                                             */
  __IO uint32_t  PDT3;                              /*!< Preempted data register 3                                             */
  __IO uint32_t  PDT4;                              /*!< Preempted data register 4                                             */
  __IO uint32_t  ODT;                               /*!< Ordinary data register                                                */
  __IO uint32_t  RESERVED0[12];
  __IO uint32_t  OVSP;                              /*!< oversampling register                                                 */
  __IO uint32_t  RESERVED1[12];
  __IO uint32_t  CALVAL;                            /*!< A/D calibration value                                                 */
} ADC_TypeDef;

/**
  * @brief ADC common area (ADCCOM)
  */

typedef struct
{                                                   /*!< ADCCOM Structure                                                      */
  __IO uint32_t  CSTS;                              /*!< Common status register                                                */
  __IO uint32_t  CCTRL;                             /*!< Common control register                                               */
  __IO uint32_t  CODT;                              /*!< Common data register                                                  */
} ADC_Common_TypeDef;

/**
  * @brief Controller Area Network TX Mailbox Registers
  */

typedef struct
{
  __IO uint32_t  TMI;                               /*!< Transmit mailbox identifier register                                  */
  __IO uint32_t  TMC;                               /*!< Transmit mailbox data length and time stamp register                  */
  __IO uint32_t  TMDTL;                             /*!< Transmit mailbox low byte data register                               */
  __IO uint32_t  TMDTH;                             /*!< Transmit mailbox high byte data register                              */
} CAN_TxMailBox_TypeDef;

/**
  * @brief Controller Area Network FIFO Mailbox Registers
  */

typedef struct
{
  __IO uint32_t  RFI;                               /*!< Receive FIFO register                                                 */
  __IO uint32_t  RFC;                               /*!< Receive FIFO data length and time stamp register                      */
  __IO uint32_t  RFDTL;                             /*!< Receive FIFO low byte data register                                   */
  __IO uint32_t  RFDTH;                             /*!< Receive FIFO high byte data register                                  */
} CAN_FIFOMailBox_TypeDef;

/**
  * @brief Controller Area Network Filter Registers
  */

typedef struct
{
  __IO uint32_t  FFB1;                              /*!< Filter bank filtrate bit register 1                                   */
  __IO uint32_t  FFB2;                              /*!< Filter bank filtrate bit register 2                                   */
} CAN_FilterRegister_TypeDef;

/**
  * @brief Controller Area Network
  */

typedef struct
{                                                   /*!< CAN Structure                                                         */
  __IO uint32_t  MCTRL;                             /*!< Main control register                                                 */
  __IO uint32_t  MSTS;                              /*!< Main status register                                                  */
  __IO uint32_t  TSTS;                              /*!< Transmit status register                                              */
  __IO uint32_t  RF0;                               /*!< Receive FIFO 0 register                                               */
  __IO uint32_t  RF1;                               /*!< Receive FIFO 1 register                                               */
  __IO uint32_t  INTEN;                             /*!< Interrupt enable register                                             */
  __IO uint32_t  ESTS;                              /*!< Error status register                                                 */
  __IO uint32_t  BTMG;                              /*!< Bit timing register                                                   */
  __IO uint32_t  RESERVED0[88];
  CAN_TxMailBox_TypeDef  sTxMailBox[3];             /*!< Transmit mailbox registers                                            */
  CAN_FIFOMailBox_TypeDef  sFIFOMailBox[2];         /*!< Receive FIFO registers                                                */
  __IO uint32_t  RESERVED1[12];
  __IO uint32_t  FCTRL;                              /*!< Filter control register                                              */
  __IO uint32_t  FMCFG;                              /*!< Filter mode config register                                          */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  FBWCFG;                             /*!< Filter bit width config register                                     */
  __IO uint32_t  RESERVED3;
  __IO uint32_t  FRF;                                /*!< Filter related FIFO register                                         */
  __IO uint32_t  RESERVED4;
  __IO uint32_t  FACFG;                              /*!< Filter activate configuration register                               */
  __IO uint32_t  RESERVED5[8];
  CAN_FilterRegister_TypeDef  sFilterRegister[14];   /*!< Filter registers                                                     */
} CAN_TypeDef;

/**
  * @brief CRC calculation unit (CRC)
  */

typedef struct
{                                                   /*!< CRC Structure                                                         */
  __IO uint32_t  DT;                                /*!< Data register                                                         */
  __IO uint32_t  CDT;                               /*!< Common data register                                                  */
  __IO uint32_t  CTRL;                              /*!< Control register                                                      */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  IDT;                               /*!< Initial data register                                                 */
  __IO uint32_t  POLY;                              /*!< Polynomial coefficient register                                       */
} CRC_TypeDef;

/**
  * @brief Clock and reset management (CRM)
  */

typedef struct
{                                                   /*!< CRM Structure                                                         */
  __IO uint32_t  CTRL;                              /*!< Clock control register                                                */
  __IO uint32_t  PLLCFG;                            /*!< PLL configuration register (CRM_PLLCFG)                               */
  __IO uint32_t  CFG;                               /*!< Clock configuration register(CRM_CFG)                                 */
  __IO uint32_t  CLKINT;                            /*!< Clock interrupt register (CRM_CLKINT)                                 */
  __IO uint32_t  AHBRST1;                           /*!< AHB peripheral reset register1 (CRM_AHBRST1)                          */
  __IO uint32_t  AHBRST2;                           /*!< AHB peripheral reset register 2 (CRM_AHBRST2)                         */
  __IO uint32_t  AHBRST3;                           /*!< AHB peripheral reset register 3 (CRM_AHBRST3)                         */
  __IO uint32_t  RESERVED0;
  __IO uint32_t  APB1RST;                           /*!< APB1 peripheral reset register (CRM_APB1RST)                          */
  __IO uint32_t  APB2RST;                           /*!< APB2 peripheral reset register (CRM_APB2RST)                          */
  __IO uint32_t  RESERVED1[2];
  __IO uint32_t  AHBEN1;                            /*!< AHB Peripheral Clock enable register 1 (CRM_AHBEN1)                   */
  __IO uint32_t  AHBEN2;                            /*!< AHB peripheral clock enable register 2 (CRM_AHBEN2)                   */
  __IO uint32_t  AHBEN3;                            /*!< AHB peripheral clock enable register 3 (CRM_AHBEN3)                   */
  __IO uint32_t  RESERVED2;
  __IO uint32_t  APB1EN;                            /*!< APB1 peripheral clock enable register (CRM_APB1EN)                    */
  __IO uint32_t  APB2EN;                            /*!< APB2 peripheral clock enable register (CRM_APB2EN)                    */
  __IO uint32_t  RESERVED3[2];
  __IO uint32_t  AHBLPEN1;                          /*!< AHB Low-power Peripheral Clock enable register 1 (CRM_AHBLPEN1)       */
  __IO uint32_t  AHBLPEN2;                          /*!< AHB peripheral Low-power clock enable register 2 (CRM_AHBLPEN2)       */
  __IO uint32_t  AHBLPEN3;                          /*!< AHB peripheral Low-power clock enable register 3 (CRM_AHBLPEN3)       */
  __IO uint32_t  RESERVED4;
  __IO uint32_t  APB1LPEN;                          /*!< APB1 peripheral Low-power clock enable register (CRM_APB1LPEN)        */
  __IO uint32_t  APB2LPEN;                          /*!< APB2 peripheral Low-power clock enable register (CRM_APB2LPEN)        */
  __IO uint32_t  RESERVED5[2];
  __IO uint32_t  BPDC;                              /*!< Battery powered domain control register (CRM_BPDC)                    */
  __IO uint32_t  CTRLSTS;                           /*!< Control/status register (CRM_CTRLSTS)                                 */
  __IO uint32_t  RESERVED6[10];
  __IO uint32_t  MISC1;                             /*!< Miscellaneous register1                                               */
  __IO uint32_t  MISC2;                             /*!< Miscellaneous register2                                               */
} CRM_TypeDef;

/**
  * @brief Debug support (DEBUG)
  */

typedef struct
{                                                   /*!< DEBUG Structure                                                       */
  __IO uint32_t  IDCODE;                            /*!< DEBUG IDCODE                                                          */
  __IO uint32_t  CTRL;                              /*!< DEBUG CTRL                                                            */
  __IO uint32_t  APB1_PAUSE;                        /*!< DEBUG APB1 PAUSE                                                      */
  __IO uint32_t  APB2_PAUSE;                        /*!< DEBUG APB2 PAUSE                                                      */
} DEBUG_TypeDef;

/**
  * @brief DMA controller (DMA)
  */

typedef struct
{                                                   /*!< DMA Structure                                                         */
  __IO uint32_t  STS;                               /*!< DMA interrupt status register (DMA_STS)                               */
  __IO uint32_t  CLR;                               /*!< DMA interrupt flag clear register (DMA_CLR)                           */
  __IO uint32_t  RESERVED1[62];
  __IO uint32_t  MUXSEL;                            /*!< DMAMUX Table Selection                                                */
} DMA_TypeDef;

/**
  * @brief DMA controller Channel(DMA Channel)
  */
typedef struct
{                                                   /*!< DMA Channel Structure                                                 */
  __IO uint32_t  CCTRL;                              /*!< DMA channel configuration register                                    */
  __IO uint32_t  CDTCNT;                             /*!< DMA channel number of data to transfer register                       */
  __IO uint32_t  CPADDR;                             /*!< DMA channel peripheral base address register                          */
  __IO uint32_t  CMADDR;                             /*!< DMA channel memory base address register                              */
} DMA_Channel_TypeDef;

/**
  * @brief DMA MUX controller
  */
typedef struct
{
  __IO uint32_t  MUXCCTRL;                            /*!< Channel Configuration Register                                       */

