ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437zx.h
#define CRM_CFG_CLKOUT_SEL1_SCLK            0x00000000U                             /*!< System clock */
#define CRM_CFG_CLKOUT_SEL1_CLKOUT_SEL2     0x40000000U                             /*!< CLKOUT_SEL2 bit in the CRM_MISC1 register */
#define CRM_CFG_CLKOUT_SEL1_HEXT            0x80000000U                             /*!< HEXT */
#define CRM_CFG_CLKOUT_SEL1_PLL             0xC0000000U                             /*!< PLL */

/* Reference defines */
#define CRM_CFG_CLKSEL1                     CRM_CFG_CLKOUT_SEL1
#define CRM_CFG_CLKSEL1_0                   CRM_CFG_CLKOUT_SEL1_0
#define CRM_CFG_CLKSEL1_1                   CRM_CFG_CLKOUT_SEL1_1
#define CRM_CFG_CLKSEL1_SCLK                CRM_CFG_CLKOUT_SEL1_SCLK
#define CRM_CFG_CLKSEL1_CLKOUT_SEL2         CRM_CFG_CLKOUT_SEL1_CLKOUT_SEL2
#define CRM_CFG_CLKSEL1_HEXT                CRM_CFG_CLKOUT_SEL1_HEXT
#define CRM_CFG_CLKSEL1_PLL                 CRM_CFG_CLKOUT_SEL1_PLL

/*!<***************  Bit definition for CRM_CLKINT register  ******************/
#define CRM_CLKINT_LICKSTBLF_Pos            (0U)
#define CRM_CLKINT_LICKSTBLF_Msk            (0x1U << CRM_CLKINT_LICKSTBLF_Pos)      /*!< 0x00000001 */
#define CRM_CLKINT_LICKSTBLF                CRM_CLKINT_LICKSTBLF_Msk                /*!< LICK stable interrupt flag */
#define CRM_CLKINT_LEXTSTBLF_Pos            (1U)
#define CRM_CLKINT_LEXTSTBLF_Msk            (0x1U << CRM_CLKINT_LEXTSTBLF_Pos)      /*!< 0x00000002 */
#define CRM_CLKINT_LEXTSTBLF                CRM_CLKINT_LEXTSTBLF_Msk                /*!< LEXT stable flag */
#define CRM_CLKINT_HICKSTBLF_Pos            (2U)
#define CRM_CLKINT_HICKSTBLF_Msk            (0x1U << CRM_CLKINT_HICKSTBLF_Pos)      /*!< 0x00000004 */
#define CRM_CLKINT_HICKSTBLF                CRM_CLKINT_HICKSTBLF_Msk                /*!< HICK stable flag */
#define CRM_CLKINT_HEXTSTBLF_Pos            (3U)
#define CRM_CLKINT_HEXTSTBLF_Msk            (0x1U << CRM_CLKINT_HEXTSTBLF_Pos)      /*!< 0x00000008 */
#define CRM_CLKINT_HEXTSTBLF                CRM_CLKINT_HEXTSTBLF_Msk                /*!< HEXT stable flag */
#define CRM_CLKINT_PLLSTBLF_Pos             (4U)
#define CRM_CLKINT_PLLSTBLF_Msk             (0x1U << CRM_CLKINT_PLLSTBLF_Pos)       /*!< 0x00000010 */
#define CRM_CLKINT_PLLSTBLF                 CRM_CLKINT_PLLSTBLF_Msk                 /*!< PLL stable flag */
#define CRM_CLKINT_CFDF_Pos                 (7U)
#define CRM_CLKINT_CFDF_Msk                 (0x1U << CRM_CLKINT_CFDF_Pos)           /*!< 0x00000080 */
#define CRM_CLKINT_CFDF                     CRM_CLKINT_CFDF_Msk                     /*!< Clock failure detection flag */
#define CRM_CLKINT_LICKSTBLIEN_Pos          (8U)
#define CRM_CLKINT_LICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_LICKSTBLIEN_Pos)    /*!< 0x00000100 */
#define CRM_CLKINT_LICKSTBLIEN              CRM_CLKINT_LICKSTBLIEN_Msk              /*!< LICK stable interrupt enable */
#define CRM_CLKINT_LEXTSTBLIEN_Pos          (9U)
#define CRM_CLKINT_LEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_LEXTSTBLIEN_Pos)    /*!< 0x00000200 */
#define CRM_CLKINT_LEXTSTBLIEN              CRM_CLKINT_LEXTSTBLIEN_Msk              /*!< LEXT stable interrupt enable */
#define CRM_CLKINT_HICKSTBLIEN_Pos          (10U)
#define CRM_CLKINT_HICKSTBLIEN_Msk          (0x1U << CRM_CLKINT_HICKSTBLIEN_Pos)    /*!< 0x00000400 */
#define CRM_CLKINT_HICKSTBLIEN              CRM_CLKINT_HICKSTBLIEN_Msk              /*!< HICK stable interrupt enable */
#define CRM_CLKINT_HEXTSTBLIEN_Pos          (11U)
#define CRM_CLKINT_HEXTSTBLIEN_Msk          (0x1U << CRM_CLKINT_HEXTSTBLIEN_Pos)    /*!< 0x00000800 */
#define CRM_CLKINT_HEXTSTBLIEN              CRM_CLKINT_HEXTSTBLIEN_Msk              /*!< HEXT stable interrupt enable */
#define CRM_CLKINT_PLLSTBLIEN_Pos           (12U)
#define CRM_CLKINT_PLLSTBLIEN_Msk           (0x1U << CRM_CLKINT_PLLSTBLIEN_Pos)     /*!< 0x00001000 */
#define CRM_CLKINT_PLLSTBLIEN               CRM_CLKINT_PLLSTBLIEN_Msk               /*!< PLL stable interrupt enable */
#define CRM_CLKINT_LICKSTBLFC_Pos           (16U)
#define CRM_CLKINT_LICKSTBLFC_Msk           (0x1U << CRM_CLKINT_LICKSTBLFC_Pos)     /*!< 0x00010000 */
#define CRM_CLKINT_LICKSTBLFC               CRM_CLKINT_LICKSTBLFC_Msk               /*!< LICK stable flag clear */
#define CRM_CLKINT_LEXTSTBLFC_Pos           (17U)
#define CRM_CLKINT_LEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_LEXTSTBLFC_Pos)     /*!< 0x00020000 */
#define CRM_CLKINT_LEXTSTBLFC               CRM_CLKINT_LEXTSTBLFC_Msk               /*!< LEXT stable flag clear */
#define CRM_CLKINT_HICKSTBLFC_Pos           (18U)
#define CRM_CLKINT_HICKSTBLFC_Msk           (0x1U << CRM_CLKINT_HICKSTBLFC_Pos)     /*!< 0x00040000 */
#define CRM_CLKINT_HICKSTBLFC               CRM_CLKINT_HICKSTBLFC_Msk               /*!< HICK stable flag clear */
#define CRM_CLKINT_HEXTSTBLFC_Pos           (19U)
#define CRM_CLKINT_HEXTSTBLFC_Msk           (0x1U << CRM_CLKINT_HEXTSTBLFC_Pos)     /*!< 0x00080000 */
#define CRM_CLKINT_HEXTSTBLFC               CRM_CLKINT_HEXTSTBLFC_Msk               /*!< HEXT stable flag clear */
#define CRM_CLKINT_PLLSTBLFC_Pos            (20U)
#define CRM_CLKINT_PLLSTBLFC_Msk            (0x1U << CRM_CLKINT_PLLSTBLFC_Pos)      /*!< 0x00100000 */
#define CRM_CLKINT_PLLSTBLFC                CRM_CLKINT_PLLSTBLFC_Msk                /*!< PLL stable flag clear */
#define CRM_CLKINT_CFDFC_Pos                (23U)
#define CRM_CLKINT_CFDFC_Msk                (0x1U << CRM_CLKINT_CFDFC_Pos)          /*!< 0x00800000 */
#define CRM_CLKINT_CFDFC                    CRM_CLKINT_CFDFC_Msk                    /*!< Clock failure detection flag clear */

/*****************  Bit definition for CRM_AHBRST1 register  ******************/
#define CRM_AHBRST1_GPIOARST_Pos            (0U)
#define CRM_AHBRST1_GPIOARST_Msk            (0x1U << CRM_AHBRST1_GPIOARST_Pos)      /*!< 0x00000001 */
#define CRM_AHBRST1_GPIOARST                CRM_AHBRST1_GPIOARST_Msk                /*!< IO port A reset */
#define CRM_AHBRST1_GPIOBRST_Pos            (1U)
#define CRM_AHBRST1_GPIOBRST_Msk            (0x1U << CRM_AHBRST1_GPIOBRST_Pos)      /*!< 0x00000002 */
#define CRM_AHBRST1_GPIOBRST                CRM_AHBRST1_GPIOBRST_Msk                /*!< IO port B reset */
#define CRM_AHBRST1_GPIOCRST_Pos            (2U)
#define CRM_AHBRST1_GPIOCRST_Msk            (0x1U << CRM_AHBRST1_GPIOCRST_Pos)      /*!< 0x00000004 */
#define CRM_AHBRST1_GPIOCRST                CRM_AHBRST1_GPIOCRST_Msk                /*!< IO port C reset */
#define CRM_AHBRST1_GPIODRST_Pos            (3U)
#define CRM_AHBRST1_GPIODRST_Msk            (0x1U << CRM_AHBRST1_GPIODRST_Pos)      /*!< 0x00000008 */
#define CRM_AHBRST1_GPIODRST                CRM_AHBRST1_GPIODRST_Msk                /*!< IO port D reset */
#define CRM_AHBRST1_GPIOERST_Pos            (4U)
#define CRM_AHBRST1_GPIOERST_Msk            (0x1U << CRM_AHBRST1_GPIOERST_Pos)      /*!< 0x00000010 */
#define CRM_AHBRST1_GPIOERST                CRM_AHBRST1_GPIOERST_Msk                /*!< IO port E reset */
#define CRM_AHBRST1_GPIOFRST_Pos            (5U)
#define CRM_AHBRST1_GPIOFRST_Msk            (0x1U << CRM_AHBRST1_GPIOFRST_Pos)      /*!< 0x00000020 */
#define CRM_AHBRST1_GPIOFRST                CRM_AHBRST1_GPIOFRST_Msk                /*!< IO port F reset */
#define CRM_AHBRST1_GPIOGRST_Pos            (6U)
#define CRM_AHBRST1_GPIOGRST_Msk            (0x1U << CRM_AHBRST1_GPIOGRST_Pos)      /*!< 0x00000040 */
#define CRM_AHBRST1_GPIOGRST                CRM_AHBRST1_GPIOGRST_Msk                /*!< IO port G reset */
#define CRM_AHBRST1_GPIOHRST_Pos            (7U)
#define CRM_AHBRST1_GPIOHRST_Msk            (0x1U << CRM_AHBRST1_GPIOHRST_Pos)      /*!< 0x00000080 */
#define CRM_AHBRST1_GPIOHRST                CRM_AHBRST1_GPIOHRST_Msk                /*!< IO port H reset */
#define CRM_AHBRST1_CRCRST_Pos              (12U)
#define CRM_AHBRST1_CRCRST_Msk              (0x1U << CRM_AHBRST1_CRCRST_Pos)        /*!< 0x00001000 */
#define CRM_AHBRST1_CRCRST                  CRM_AHBRST1_CRCRST_Msk                  /*!< CRC reset */
#define CRM_AHBRST1_EDMARST_Pos             (21U)
#define CRM_AHBRST1_EDMARST_Msk             (0x1U << CRM_AHBRST1_EDMARST_Pos)       /*!< 0x00200000 */
#define CRM_AHBRST1_EDMARST                 CRM_AHBRST1_EDMARST_Msk                 /*!< EDMA reset */
#define CRM_AHBRST1_DMA1RST_Pos             (22U)
#define CRM_AHBRST1_DMA1RST_Msk             (0x1U << CRM_AHBRST1_DMA1RST_Pos)       /*!< 0x00400000 */
#define CRM_AHBRST1_DMA1RST                 CRM_AHBRST1_DMA1RST_Msk                 /*!< DMA1 reset */
#define CRM_AHBRST1_DMA2RST_Pos             (24U)
#define CRM_AHBRST1_DMA2RST_Msk             (0x1U << CRM_AHBRST1_DMA2RST_Pos)       /*!< 0x01000000 */
#define CRM_AHBRST1_DMA2RST                 CRM_AHBRST1_DMA2RST_Msk                 /*!< DMA2 reset */
#define CRM_AHBRST1_EMACRST_Pos             (25U)
#define CRM_AHBRST1_EMACRST_Msk             (0x1U << CRM_AHBRST1_EMACRST_Pos)       /*!< 0x02000000 */
#define CRM_AHBRST1_EMACRST                 CRM_AHBRST1_EMACRST_Msk                 /*!< EMAC reset */

#define CRM_AHBRST1_OTGFS2RST_Pos           (29U)
#define CRM_AHBRST1_OTGFS2RST_Msk           (0x1U << CRM_AHBRST1_OTGFS2RST_Pos)      /*!< 0x20000000 */
#define CRM_AHBRST1_OTGFS2RST               CRM_AHBRST1_OTGFS2RST_Msk                /*!< OTGFS2 reset */

