ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437zx.h
/*****************  Bit definition for CRM_AHBRST2 register  ******************/
#define CRM_AHBRST2_DVPRST_Pos              (0U)
#define CRM_AHBRST2_DVPRST_Msk              (0x1U << CRM_AHBRST2_DVPRST_Pos)        /*!< 0x00000001 */
#define CRM_AHBRST2_DVPRST                  CRM_AHBRST2_DVPRST_Msk                  /*!< DVP reset */
#define CRM_AHBRST2_OTGFSRST_Pos            (7U)
#define CRM_AHBRST2_OTGFSRST_Msk            (0x1U << CRM_AHBRST2_OTGFSRST_Pos)      /*!< 0x00000080 */
#define CRM_AHBRST2_OTGFSRST                CRM_AHBRST2_OTGFSRST_Msk                /*!< OTGFS reset */
#define CRM_AHBRST2_SDIO1RST_Pos            (15U)
#define CRM_AHBRST2_SDIO1RST_Msk            (0x1U << CRM_AHBRST2_SDIO1RST_Pos)      /*!< 0x00008000 */
#define CRM_AHBRST2_SDIO1RST                CRM_AHBRST2_SDIO1RST_Msk                /*!< SDIO1 reset */

/*****************  Bit definition for CRM_AHBRST3 register  ******************/
#define CRM_AHBRST3_XMCRST_Pos              (0U)
#define CRM_AHBRST3_XMCRST_Msk              (0x1U << CRM_AHBRST2_XMCRST_Pos)        /*!< 0x00000001 */
#define CRM_AHBRST3_XMCRST                  CRM_AHBRST2_XMCRST_Msk                  /*!< XMC reset */
#define CRM_AHBRST3_QSPI1RST_Pos            (1U)
#define CRM_AHBRST3_QSPI1RST_Msk            (0x1U << CRM_AHBRST2_QSPI1RST_Pos)        /*!< 0x00000002 */
#define CRM_AHBRST3_QSPI1RST                CRM_AHBRST2_QSPI1RST_Msk                  /*!< QSPI1 reset */
#define CRM_AHBRST3_QSPI2RST_Pos            (14U)
#define CRM_AHBRST3_QSPI2RST_Msk            (0x1U << CRM_AHBRST2_QSPI2RST_Pos)        /*!< 0x00004000 */
#define CRM_AHBRST3_QSPI2RST                CRM_AHBRST2_QSPI2RST_Msk                  /*!< QSPI2 reset */
#define CRM_AHBRST3_SDIO2RST_Pos            (15U)
#define CRM_AHBRST3_SDIO2RST_Msk            (0x1U << CRM_AHBRST3_SDIO2RST_Pos)        /*!< 0x00008000 */
#define CRM_AHBRST3_SDIO2RST                CRM_AHBRST3_SDIO2RST_Msk                  /*!< SDIO2 reset */


/*****************  Bit definition for CRM_APB1RST register  ******************/
#define CRM_APB1RST_TMR2RST_Pos             (0U)
#define CRM_APB1RST_TMR2RST_Msk             (0x1U << CRM_APB1RST_TMR2RST_Pos)       /*!< 0x00000001 */
#define CRM_APB1RST_TMR2RST                 CRM_APB1RST_TMR2RST_Msk                 /*!< TMR2 reset */
#define CRM_APB1RST_TMR3RST_Pos             (1U)
#define CRM_APB1RST_TMR3RST_Msk             (0x1U << CRM_APB1RST_TMR3RST_Pos)       /*!< 0x00000002 */
#define CRM_APB1RST_TMR3RST                 CRM_APB1RST_TMR3RST_Msk                 /*!< TMR3 reset */
#define CRM_APB1RST_TMR4RST_Pos             (2U)
#define CRM_APB1RST_TMR4RST_Msk             (0x1U << CRM_APB1RST_TMR4RST_Pos)       /*!< 0x00000004 */
#define CRM_APB1RST_TMR4RST                 CRM_APB1RST_TMR4RST_Msk                 /*!< TMR4 reset */
#define CRM_APB1RST_TMR5RST_Pos             (3U)
#define CRM_APB1RST_TMR5RST_Msk             (0x1U << CRM_APB1RST_TMR5RST_Pos)       /*!< 0x00000008 */
#define CRM_APB1RST_TMR5RST                 CRM_APB1RST_TMR5RST_Msk                 /*!< TMR5 reset */
#define CRM_APB1RST_TMR6RST_Pos             (4U)
#define CRM_APB1RST_TMR6RST_Msk             (0x1U << CRM_APB1RST_TMR6RST_Pos)       /*!< 0x00000010 */
#define CRM_APB1RST_TMR6RST                 CRM_APB1RST_TMR6RST_Msk                 /*!< TMR6 reset */
#define CRM_APB1RST_TMR7RST_Pos             (5U)
#define CRM_APB1RST_TMR7RST_Msk             (0x1U << CRM_APB1RST_TMR7RST_Pos)       /*!< 0x00000020 */
#define CRM_APB1RST_TMR7RST                 CRM_APB1RST_TMR7RST_Msk                 /*!< TMR7 reset */
#define CRM_APB1RST_TMR12RST_Pos            (6U)
#define CRM_APB1RST_TMR12RST_Msk            (0x1U << CRM_APB1RST_TMR12RST_Pos)       /*!< 0x00000040 */
#define CRM_APB1RST_TMR12RST                CRM_APB1RST_TMR12RST_Msk                 /*!< TMR12 reset */
#define CRM_APB1RST_TMR13RST_Pos            (7U)
#define CRM_APB1RST_TMR13RST_Msk            (0x1U << CRM_APB1RST_TMR13RST_Pos)      /*!< 0x00000080 */
#define CRM_APB1RST_TMR13RST                CRM_APB1RST_TMR13RST_Msk                /*!< TMR13 reset */
#define CRM_APB1RST_TMR14RST_Pos            (8U)
#define CRM_APB1RST_TMR14RST_Msk            (0x1U << CRM_APB1RST_TMR14RST_Pos)      /*!< 0x00000100 */
#define CRM_APB1RST_TMR14RST                CRM_APB1RST_TMR14RST_Msk                /*!< TMR14 reset */
#define CRM_APB1RST_WWDTRST_Pos             (11U)
#define CRM_APB1RST_WWDTRST_Msk             (0x1U << CRM_APB1RST_WWDTRST_Pos)       /*!< 0x00000800 */
#define CRM_APB1RST_WWDTRST                 CRM_APB1RST_WWDTRST_Msk                 /*!< WWDT reset */
#define CRM_APB1RST_SPI2RST_Pos             (14U)
#define CRM_APB1RST_SPI2RST_Msk             (0x1U << CRM_APB1RST_SPI2RST_Pos)       /*!< 0x00004000 */
#define CRM_APB1RST_SPI2RST                 CRM_APB1RST_SPI2RST_Msk                 /*!< SPI2 reset */
#define CRM_APB1RST_SPI3RST_Pos             (15U)
#define CRM_APB1RST_SPI3RST_Msk             (0x1U << CRM_APB1RST_SPI3RST_Pos)       /*!< 0x00008000 */
#define CRM_APB1RST_SPI3RST                 CRM_APB1RST_SPI3RST_Msk                 /*!< SPI3 reset */
#define CRM_APB1RST_USART2RST_Pos           (17U)
#define CRM_APB1RST_USART2RST_Msk           (0x1U << CRM_APB1RST_USART2RST_Pos)     /*!< 0x00020000 */
#define CRM_APB1RST_USART2RST               CRM_APB1RST_USART2RST_Msk               /*!< USART2 reset */
#define CRM_APB1RST_USART3RST_Pos           (18U)
#define CRM_APB1RST_USART3RST_Msk           (0x1U << CRM_APB1RST_USART3RST_Pos)     /*!< 0x00040000 */
#define CRM_APB1RST_USART3RST               CRM_APB1RST_USART3RST_Msk               /*!< USART3 reset */
#define CRM_APB1RST_USART4RST_Pos           (19U)
#define CRM_APB1RST_USART4RST_Msk           (0x1U << CRM_APB1RST_USART4RST_Pos)     /*!< 0x00080000 */
#define CRM_APB1RST_USART4RST               CRM_APB1RST_USART4RST_Msk               /*!< USART4 reset */
#define CRM_APB1RST_USART5RST_Pos           (20U)
#define CRM_APB1RST_USART5RST_Msk           (0x1U << CRM_APB1RST_USART5RST_Pos)     /*!< 0x00100000 */
#define CRM_APB1RST_USART5RST               CRM_APB1RST_USART5RST_Msk               /*!< USART5 reset */
#define CRM_APB1RST_I2C1RST_Pos             (21U)
#define CRM_APB1RST_I2C1RST_Msk             (0x1U << CRM_APB1RST_I2C1RST_Pos)       /*!< 0x00200000 */
#define CRM_APB1RST_I2C1RST                 CRM_APB1RST_I2C1RST_Msk                 /*!< I2C1 reset */
#define CRM_APB1RST_I2C2RST_Pos             (22U)
#define CRM_APB1RST_I2C2RST_Msk             (0x1U << CRM_APB1RST_I2C2RST_Pos)       /*!< 0x00400000 */
#define CRM_APB1RST_I2C2RST                 CRM_APB1RST_I2C2RST_Msk                 /*!< I2C2 reset */
#define CRM_APB1RST_I2C3RST_Pos             (23U)
#define CRM_APB1RST_I2C3RST_Msk             (0x1U << CRM_APB1RST_I2C3RST_Pos)       /*!< 0x00800000 */
#define CRM_APB1RST_I2C3RST                 CRM_APB1RST_I2C3RST_Msk                 /*!< I2C3 reset */
#define CRM_APB1RST_CAN1RST_Pos             (25U)
#define CRM_APB1RST_CAN1RST_Msk             (0x1U << CRM_APB1RST_CAN1RST_Pos)       /*!< 0x02000000 */
#define CRM_APB1RST_CAN1RST                 CRM_APB1RST_CAN1RST_Msk                 /*!< CAN1 reset */
#define CRM_APB1RST_CAN2RST_Pos             (26U)
#define CRM_APB1RST_CAN2RST_Msk             (0x1U << CRM_APB1RST_CAN2RST_Pos)       /*!< 0x04000000 */
#define CRM_APB1RST_CAN2RST                 CRM_APB1RST_CAN2RST_Msk                 /*!< CAN2 reset */
#define CRM_APB1RST_PWCRST_Pos              (28U)
#define CRM_APB1RST_PWCRST_Msk              (0x1U << CRM_APB1RST_PWCRST_Pos)        /*!< 0x10000000 */
#define CRM_APB1RST_PWCRST                  CRM_APB1RST_PWCRST_Msk                  /*!< PWC reset */
#define CRM_APB1RST_DACRST_Pos              (29U)
#define CRM_APB1RST_DACRST_Msk              (0x1U << CRM_APB1RST_DACRST_Pos)        /*!< 0x20000000 */
#define CRM_APB1RST_DACRST                  CRM_APB1RST_DACRST_Msk                  /*!< DAC reset */
#define CRM_APB1RST_UART7RST_Pos            (30U)
#define CRM_APB1RST_UART7RST_Msk            (0x1U << CRM_APB1RST_UART7RST_Pos)      /*!< 0x40000000 */
#define CRM_APB1RST_UART7RST                CRM_APB1RST_UART7RST_Msk                /*!< UART7 reset */
#define CRM_APB1RST_UART8RST_Pos            (31U)
#define CRM_APB1RST_UART8RST_Msk            (0x1U << CRM_APB1RST_UART8RST_Pos)      /*!< 0x80000000 */
#define CRM_APB1RST_UART8RST                CRM_APB1RST_UART8RST_Msk                /*!< UART8 reset */

/*****************  Bit definition for CRM_APB2RST register  ******************/
#define CRM_APB2RST_TMR1RST_Pos             (0U)
#define CRM_APB2RST_TMR1RST_Msk             (0x1U << CRM_APB2RST_TMR1RST_Pos)       /*!< 0x00000001 */
#define CRM_APB2RST_TMR1RST                 CRM_APB2RST_TMR1RST_Msk                 /*!< TMR1 reset */
#define CRM_APB2RST_TMR8RST_Pos             (1U)
#define CRM_APB2RST_TMR8RST_Msk             (0x1U << CRM_APB2RST_TMR8RST_Pos)       /*!< 0x00000002 */
#define CRM_APB2RST_TMR8RST                 CRM_APB2RST_TMR8RST_Msk                 /*!< TMR8 reset */
#define CRM_APB2RST_USART1RST_Pos           (4U)
#define CRM_APB2RST_USART1RST_Msk           (0x1U << CRM_APB2RST_USART1RST_Pos)     /*!< 0x00000010 */
#define CRM_APB2RST_USART1RST               CRM_APB2RST_USART1RST_Msk               /*!< USART1 reset */
#define CRM_APB2RST_USART6RST_Pos           (5U)
#define CRM_APB2RST_USART6RST_Msk           (0x1U << CRM_APB2RST_USART6RST_Pos)     /*!< 0x00000020 */
#define CRM_APB2RST_USART6RST               CRM_APB2RST_USART6RST_Msk               /*!< USART6 reset */
#define CRM_APB2RST_ADCRST_Pos              (8U)
#define CRM_APB2RST_ADCRST_Msk              (0x1U << CRM_APB2RST_ADCRST_Pos)        /*!< 0x00000100 */
#define CRM_APB2RST_ADCRST                  CRM_APB2RST_ADCRST_Msk                  /*!< ADC1 reset */
#define CRM_APB2RST_ADC2RST_Pos             (9U)
#define CRM_APB2RST_ADC2RST_Msk             (0x1U << CRM_APB2RST_ADC2RST_Pos)       /*!< 0x00000200 */
#define CRM_APB2RST_ADC2RST                 CRM_APB2RST_ADC2RST_Msk                 /*!< ADC2 reset */
#define CRM_APB2RST_ADC3RST_Pos             (10U)
#define CRM_APB2RST_ADC3RST_Msk             (0x1U << CRM_APB2RST_ADC3RST_Pos)       /*!< 0x00000400 */
#define CRM_APB2RST_ADC3RST                 CRM_APB2RST_ADC3RST_Msk                 /*!< ADC3 reset */
#define CRM_APB2RST_SPI1RST_Pos             (12U)
#define CRM_APB2RST_SPI1RST_Msk             (0x1U << CRM_APB2RST_SPI1RST_Pos)       /*!< 0x00001000 */
#define CRM_APB2RST_SPI1RST                 CRM_APB2RST_SPI1RST_Msk                 /*!< SPI1 reset */
#define CRM_APB2RST_SPI4RST_Pos             (13U)
#define CRM_APB2RST_SPI4RST_Msk             (0x1U << CRM_APB2RST_SPI4RST_Pos)       /*!< 0x00002000 */
#define CRM_APB2RST_SPI4RST                 CRM_APB2RST_SPI4RST_Msk                 /*!< SPI4 reset */
#define CRM_APB2RST_SCFGRST_Pos             (14U)
#define CRM_APB2RST_SCFGRST_Msk             (0x1U << CRM_APB2RST_SCFGRST_Pos)       /*!< 0x00004000 */
#define CRM_APB2RST_SCFGRST                 CRM_APB2RST_SCFGRST_Msk                 /*!< SCFG reset */
#define CRM_APB2RST_EXINTRST_Pos            (15U)
#define CRM_APB2RST_EXINTRST_Msk            (0x1U << CRM_APB2RST_EXINTRST_Pos)      /*!< 0x00008000 */
#define CRM_APB2RST_EXINTRST                CRM_APB2RST_EXINTRST_Msk                /*!< EXINT reset */
#define CRM_APB2RST_TMR9RST_Pos             (16U)
#define CRM_APB2RST_TMR9RST_Msk             (0x1U << CRM_APB2RST_TMR9RST_Pos)       /*!< 0x00010000 */
#define CRM_APB2RST_TMR9RST                 CRM_APB2RST_TMR9RST_Msk                 /*!< TMR9 reset */
#define CRM_APB2RST_TMR10RST_Pos            (17U)
#define CRM_APB2RST_TMR10RST_Msk            (0x1U << CRM_APB2RST_TMR10RST_Pos)      /*!< 0x00020000 */
#define CRM_APB2RST_TMR10RST                CRM_APB2RST_TMR10RST_Msk                /*!< TMR10 reset */
#define CRM_APB2RST_TMR11RST_Pos            (18U)
#define CRM_APB2RST_TMR11RST_Msk            (0x1U << CRM_APB2RST_TMR11RST_Pos)      /*!< 0x00040000 */
#define CRM_APB2RST_TMR11RST                CRM_APB2RST_TMR11RST_Msk                /*!< TMR11 reset */
#define CRM_APB2RST_TMR20RST_Pos            (20U)
#define CRM_APB2RST_TMR20RST_Msk            (0x1U << CRM_APB2RST_TMR20RST_Pos)      /*!< 0x00100000 */
#define CRM_APB2RST_TMR20RST                CRM_APB2RST_TMR20RST_Msk                /*!< TMR20 reset */
#define CRM_APB2RST_ACCRST_Pos              (29U)
#define CRM_APB2RST_ACCRST_Msk              (0x1U << CRM_APB2RST_ACCRST_Pos)        /*!< 0x20000000 */
#define CRM_APB2RST_ACCRST                  CRM_APB2RST_ACCRST_Msk                  /*!< ACC reset */

