ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437zx.h
/******************  Bit definition for CRM_APB1EN register  ******************/
#define CRM_APB1EN_TMR2EN_Pos               (0U)
#define CRM_APB1EN_TMR2EN_Msk               (0x1U << CRM_APB1EN_TMR2EN_Pos)         /*!< 0x00000001 */
#define CRM_APB1EN_TMR2EN                   CRM_APB1EN_TMR2EN_Msk                   /*!< TMR2 clock enable */
#define CRM_APB1EN_TMR3EN_Pos               (1U)
#define CRM_APB1EN_TMR3EN_Msk               (0x1U << CRM_APB1EN_TMR3EN_Pos)         /*!< 0x00000002 */
#define CRM_APB1EN_TMR3EN                   CRM_APB1EN_TMR3EN_Msk                   /*!< TMR3 clock enable */
#define CRM_APB1EN_TMR4EN_Pos               (2U)
#define CRM_APB1EN_TMR4EN_Msk               (0x1U << CRM_APB1EN_TMR4EN_Pos)         /*!< 0x00000004 */
#define CRM_APB1EN_TMR4EN                   CRM_APB1EN_TMR4EN_Msk                   /*!< TMR4 clock enable */
#define CRM_APB1EN_TMR5EN_Pos               (3U)
#define CRM_APB1EN_TMR5EN_Msk               (0x1U << CRM_APB1EN_TMR5EN_Pos)         /*!< 0x00000008 */
#define CRM_APB1EN_TMR5EN                   CRM_APB1EN_TMR5EN_Msk                   /*!< TMR5 clock enable */
#define CRM_APB1EN_TMR6EN_Pos               (4U)
#define CRM_APB1EN_TMR6EN_Msk               (0x1U << CRM_APB1EN_TMR6EN_Pos)         /*!< 0x00000010 */
#define CRM_APB1EN_TMR6EN                   CRM_APB1EN_TMR6EN_Msk                   /*!< TMR6 clock enable */
#define CRM_APB1EN_TMR7EN_Pos               (5U)
#define CRM_APB1EN_TMR7EN_Msk               (0x1U << CRM_APB1EN_TMR7EN_Pos)         /*!< 0x00000020 */
#define CRM_APB1EN_TMR7EN                   CRM_APB1EN_TMR7EN_Msk                   /*!< TMR7 clock enable */
#define CRM_APB1EN_TMR12EN_Pos              (6U)
#define CRM_APB1EN_TMR12EN_Msk              (0x1U << CRM_APB1EN_TMR12EN_Pos)        /*!< 0x00000040 */
#define CRM_APB1EN_TMR12EN                  CRM_APB1EN_TMR12EN_Msk                  /*!< TMR12 clock enable */
#define CRM_APB1EN_TMR13EN_Pos              (7U)
#define CRM_APB1EN_TMR13EN_Msk              (0x1U << CRM_APB1EN_TMR13EN_Pos)        /*!< 0x00000080 */
#define CRM_APB1EN_TMR13EN                  CRM_APB1EN_TMR13EN_Msk                  /*!< TMR13 clock enable */
#define CRM_APB1EN_TMR14EN_Pos              (8U)
#define CRM_APB1EN_TMR14EN_Msk              (0x1U << CRM_APB1EN_TMR14EN_Pos)        /*!< 0x00000100 */
#define CRM_APB1EN_TMR14EN                  CRM_APB1EN_TMR14EN_Msk                  /*!< TMR14 clock enable */
#define CRM_APB1EN_WWDTEN_Pos               (11U)
#define CRM_APB1EN_WWDTEN_Msk               (0x1U << CRM_APB1EN_WWDTEN_Pos)         /*!< 0x00000800 */
#define CRM_APB1EN_WWDTEN                   CRM_APB1EN_WWDTEN_Msk                   /*!< WWDT clock enable */
#define CRM_APB1EN_SPI2EN_Pos               (14U)
#define CRM_APB1EN_SPI2EN_Msk               (0x1U << CRM_APB1EN_SPI2EN_Pos)         /*!< 0x00004000 */
#define CRM_APB1EN_SPI2EN                   CRM_APB1EN_SPI2EN_Msk                   /*!< SPI2 clock enable */
#define CRM_APB1EN_SPI3EN_Pos               (15U)
#define CRM_APB1EN_SPI3EN_Msk               (0x1U << CRM_APB1EN_SPI3EN_Pos)         /*!< 0x00008000 */
#define CRM_APB1EN_SPI3EN                   CRM_APB1EN_SPI3EN_Msk                   /*!< SPI3 clock enable */
#define CRM_APB1EN_USART2EN_Pos             (17U)
#define CRM_APB1EN_USART2EN_Msk             (0x1U << CRM_APB1EN_USART2EN_Pos)       /*!< 0x00020000 */
#define CRM_APB1EN_USART2EN                 CRM_APB1EN_USART2EN_Msk                 /*!< USART2 clock enable */
#define CRM_APB1EN_USART3EN_Pos             (18U)
#define CRM_APB1EN_USART3EN_Msk             (0x1U << CRM_APB1EN_USART3EN_Pos)       /*!< 0x00040000 */
#define CRM_APB1EN_USART3EN                 CRM_APB1EN_USART3EN_Msk                 /*!< USART3 clock enable */
#define CRM_APB1EN_USART4EN_Pos             (19U)
#define CRM_APB1EN_USART4EN_Msk             (0x1U << CRM_APB1EN_USART4EN_Pos)       /*!< 0x00080000 */
#define CRM_APB1EN_USART4EN                 CRM_APB1EN_USART4EN_Msk                 /*!< USART4 clock enable */
#define CRM_APB1EN_USART5EN_Pos             (20U)
#define CRM_APB1EN_USART5EN_Msk             (0x1U << CRM_APB1EN_USART5EN_Pos)       /*!< 0x00100000 */
#define CRM_APB1EN_USART5EN                 CRM_APB1EN_USART5EN_Msk                 /*!< USART5 clock enable */
#define CRM_APB1EN_I2C1EN_Pos               (21U)
#define CRM_APB1EN_I2C1EN_Msk               (0x1U << CRM_APB1EN_I2C1EN_Pos)         /*!< 0x00200000 */
#define CRM_APB1EN_I2C1EN                   CRM_APB1EN_I2C1EN_Msk                   /*!< I2C1 clock enable */
#define CRM_APB1EN_I2C2EN_Pos               (22U)
#define CRM_APB1EN_I2C2EN_Msk               (0x1U << CRM_APB1EN_I2C2EN_Pos)         /*!< 0x00400000 */
#define CRM_APB1EN_I2C2EN                   CRM_APB1EN_I2C2EN_Msk                   /*!< I2C2 clock enable */
#define CRM_APB1EN_I2C3EN_Pos               (23U)
#define CRM_APB1EN_I2C3EN_Msk               (0x1U << CRM_APB1EN_I2C3EN_Pos)         /*!< 0x00800000 */
#define CRM_APB1EN_I2C3EN                   CRM_APB1EN_I2C3EN_Msk                   /*!< I2C3 clock enable */
#define CRM_APB1EN_CAN1EN_Pos               (25U)
#define CRM_APB1EN_CAN1EN_Msk               (0x1U << CRM_APB1EN_CAN1EN_Pos)         /*!< 0x02000000 */
#define CRM_APB1EN_CAN1EN                   CRM_APB1EN_CAN1EN_Msk                   /*!< CAN1 clock enable */
#define CRM_APB1EN_CAN2EN_Pos               (26U)
#define CRM_APB1EN_CAN2EN_Msk               (0x1U << CRM_APB1EN_CAN2EN_Pos)         /*!< 0x04000000 */
#define CRM_APB1EN_CAN2EN                   CRM_APB1EN_CAN2EN_Msk                   /*!< CAN2 clock enable */
#define CRM_APB1EN_PWCEN_Pos                (28U)
#define CRM_APB1EN_PWCEN_Msk                (0x1U << CRM_APB1EN_PWCEN_Pos)          /*!< 0x10000000 */
#define CRM_APB1EN_PWCEN                    CRM_APB1EN_PWCEN_Msk                    /*!< Power control clock enable */
#define CRM_APB1EN_DACEN_Pos                (29U)
#define CRM_APB1EN_DACEN_Msk                (0x1U << CRM_APB1EN_DACEN_Pos)          /*!< 0x20000000 */
#define CRM_APB1EN_DACEN                    CRM_APB1EN_DACEN_Msk                    /*!< DAC clock enable */
#define CRM_APB1EN_UART7EN_Pos              (30U)
#define CRM_APB1EN_UART7EN_Msk              (0x1U << CRM_APB1EN_UART7EN_Pos)        /*!< 0x40000000 */
#define CRM_APB1EN_UART7EN                  CRM_APB1EN_UART7EN_Msk                  /*!< UART7 clock enable */
#define CRM_APB1EN_UART8EN_Pos              (31U)
#define CRM_APB1EN_UART8EN_Msk              (0x1U << CRM_APB1EN_UART8EN_Pos)        /*!< 0x80000000 */
#define CRM_APB1EN_UART8EN                  CRM_APB1EN_UART8EN_Msk                  /*!< UART8 clock enable */

/******************  Bit definition for CRM_APB2EN register  ******************/
#define CRM_APB2EN_TMR1EN_Pos               (0U)
#define CRM_APB2EN_TMR1EN_Msk               (0x1U << CRM_APB2EN_TMR1EN_Pos)         /*!< 0x00000001 */
#define CRM_APB2EN_TMR1EN                   CRM_APB2EN_TMR1EN_Msk                   /*!< TMR1 clock enable */
#define CRM_APB2EN_TMR8EN_Pos               (1U)
#define CRM_APB2EN_TMR8EN_Msk               (0x1U << CRM_APB2EN_TMR8EN_Pos)         /*!< 0x00000002 */
#define CRM_APB2EN_TMR8EN                   CRM_APB2EN_TMR8EN_Msk                   /*!< TMR8 clock enable */
#define CRM_APB2EN_USART1EN_Pos             (4U)
#define CRM_APB2EN_USART1EN_Msk             (0x1U << CRM_APB2EN_USART1EN_Pos)       /*!< 0x00000010 */
#define CRM_APB2EN_USART1EN                 CRM_APB2EN_USART1EN_Msk                 /*!< USART1 clock enable */
#define CRM_APB2EN_USART6EN_Pos             (5U)
#define CRM_APB2EN_USART6EN_Msk             (0x1U << CRM_APB2EN_USART6EN_Pos)       /*!< 0x00000020 */
#define CRM_APB2EN_USART6EN                 CRM_APB2EN_USART6EN_Msk                 /*!< USART6 clock enable */
#define CRM_APB2EN_ADC1EN_Pos               (8U)
#define CRM_APB2EN_ADC1EN_Msk               (0x1U << CRM_APB2EN_ADC1EN_Pos)         /*!< 0x00000100 */
#define CRM_APB2EN_ADC1EN                   CRM_APB2EN_ADC1EN_Msk                   /*!< ADC1 clock enable */
#define CRM_APB2EN_ADC2EN_Pos               (9U)
#define CRM_APB2EN_ADC2EN_Msk               (0x1U << CRM_APB2EN_ADC2EN_Pos)         /*!< 0x00000200 */
#define CRM_APB2EN_ADC2EN                   CRM_APB2EN_ADC2EN_Msk                   /*!< ADC2 clock enable */
#define CRM_APB2EN_ADC3EN_Pos               (10U)
#define CRM_APB2EN_ADC3EN_Msk               (0x1U << CRM_APB2EN_ADC3EN_Pos)         /*!< 0x00000400 */
#define CRM_APB2EN_ADC3EN                   CRM_APB2EN_ADC3EN_Msk                   /*!< ADC3 clock enable */
#define CRM_APB2EN_SPI1EN_Pos               (12U)
#define CRM_APB2EN_SPI1EN_Msk               (0x1U << CRM_APB2EN_SPI1EN_Pos)         /*!< 0x00001000 */
#define CRM_APB2EN_SPI1EN                   CRM_APB2EN_SPI1EN_Msk                   /*!< SPI1 clock enable */
#define CRM_APB2EN_SPI4EN_Pos               (13U)
#define CRM_APB2EN_SPI4EN_Msk               (0x1U << CRM_APB2EN_SPI4EN_Pos)         /*!< 0x00002000 */
#define CRM_APB2EN_SPI4EN                   CRM_APB2EN_SPI4EN_Msk                   /*!< SPI4 clock enable */
#define CRM_APB2EN_SCFGEN_Pos               (14U)
#define CRM_APB2EN_SCFGEN_Msk               (0x1U << CRM_APB2EN_SCFGEN_Pos)         /*!< 0x00004000 */
#define CRM_APB2EN_SCFGEN                   CRM_APB2EN_SCFGEN_Msk                   /*!< SCFG clock enable */
#define CRM_APB2EN_TMR9EN_Pos               (16U)
#define CRM_APB2EN_TMR9EN_Msk               (0x1U << CRM_APB2EN_TMR9EN_Pos)         /*!< 0x00010000 */
#define CRM_APB2EN_TMR9EN                   CRM_APB2EN_TMR9EN_Msk                   /*!< TMR9 clock enable */
#define CRM_APB2EN_TMR10EN_Pos              (17U)
#define CRM_APB2EN_TMR10EN_Msk              (0x1U << CRM_APB2EN_TMR10EN_Pos)        /*!< 0x00020000 */
#define CRM_APB2EN_TMR10EN                  CRM_APB2EN_TMR10EN_Msk                  /*!< TMR10 clock enable */
#define CRM_APB2EN_TMR11EN_Pos              (18U)
#define CRM_APB2EN_TMR11EN_Msk              (0x1U << CRM_APB2EN_TMR11EN_Pos)        /*!< 0x00040000 */
#define CRM_APB2EN_TMR11EN                  CRM_APB2EN_TMR11EN_Msk                  /*!< TMR11 clock enable */
#define CRM_APB2EN_TMR20EN_Pos              (20U)
#define CRM_APB2EN_TMR20EN_Msk              (0x1U << CRM_APB2EN_TMR20EN_Pos)        /*!< 0x00100000 */
#define CRM_APB2EN_TMR20EN                  CRM_APB2EN_TMR20EN_Msk                  /*!< TMR20 clock enable */
#define CRM_APB2EN_ACCEN_Pos                (29U)
#define CRM_APB2EN_ACCEN_Msk                (0x1U << CRM_APB2EN_ACCEN_Pos)          /*!< 0x20000000 */
#define CRM_APB2EN_ACCEN                    CRM_APB2EN_ACCEN_Msk                    /*!< ACC clock enable */

/*****************  Bit definition for CRM_AHBLPEN1 register  *****************/
#define CRM_AHBLPEN1_GPIOALPEN_Pos          (0U)
#define CRM_AHBLPEN1_GPIOALPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOALPEN_Pos)    /*!< 0x00000001 */
#define CRM_AHBLPEN1_GPIOALPEN              CRM_AHBLPEN1_GPIOALPEN_Msk              /*!< IO port A clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOBLPEN_Pos          (1U)
#define CRM_AHBLPEN1_GPIOBLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOBLPEN_Pos)    /*!< 0x00000002 */
#define CRM_AHBLPEN1_GPIOBLPEN              CRM_AHBLPEN1_GPIOBLPEN_Msk              /*!< IO port B clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOCLPEN_Pos          (2U)
#define CRM_AHBLPEN1_GPIOCLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOCLPEN_Pos)    /*!< 0x00000004 */
#define CRM_AHBLPEN1_GPIOCLPEN              CRM_AHBLPEN1_GPIOCLPEN_Msk              /*!< IO port C clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIODLPEN_Pos          (3U)
#define CRM_AHBLPEN1_GPIODLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIODLPEN_Pos)    /*!< 0x00000008 */
#define CRM_AHBLPEN1_GPIODLPEN              CRM_AHBLPEN1_GPIODLPEN_Msk              /*!< IO port D clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOELPEN_Pos          (4U)
#define CRM_AHBLPEN1_GPIOELPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOELPEN_Pos)    /*!< 0x00000010 */
#define CRM_AHBLPEN1_GPIOELPEN              CRM_AHBLPEN1_GPIOELPEN_Msk              /*!< IO port E clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOFLPEN_Pos          (5U)
#define CRM_AHBLPEN1_GPIOFLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOFLPEN_Pos)    /*!< 0x00000020 */
#define CRM_AHBLPEN1_GPIOFLPEN              CRM_AHBLPEN1_GPIOFLPEN_Msk              /*!< IO port F clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOGLPEN_Pos          (6U)
#define CRM_AHBLPEN1_GPIOGLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOGLPEN_Pos)    /*!< 0x00000040 */
#define CRM_AHBLPEN1_GPIOGLPEN              CRM_AHBLPEN1_GPIOGLPEN_Msk              /*!< IO port G clock enable in sleep mode */
#define CRM_AHBLPEN1_GPIOHLPEN_Pos          (7U)
#define CRM_AHBLPEN1_GPIOHLPEN_Msk          (0x1U << CRM_AHBLPEN1_GPIOHLPEN_Pos)    /*!< 0x00000080 */
#define CRM_AHBLPEN1_GPIOHLPEN              CRM_AHBLPEN1_GPIOHLPEN_Msk              /*!< IO port H clock enable in sleep mode */
#define CRM_AHBLPEN1_CRCLPEN_Pos            (12U)
#define CRM_AHBLPEN1_CRCLPEN_Msk            (0x1U << CRM_AHBLPEN1_CRCLPEN_Pos)      /*!< 0x00001000 */
#define CRM_AHBLPEN1_CRCLPEN                CRM_AHBLPEN1_CRCLPEN_Msk                /*!< CRC clock enable in sleep mode */
#define CRM_AHBLPEN1_FLASHLPEN_Pos          (15U)
#define CRM_AHBLPEN1_FLASHLPEN_Msk          (0x1U << CRM_AHBLPEN1_FLASHLPEN_Pos)    /*!< 0x00008000 */
#define CRM_AHBLPEN1_FLASHLPEN              CRM_AHBLPEN1_FLASHLPEN_Msk              /*!< FLASH clock enable in sleep mode */
#define CRM_AHBLPEN1_SRAMLPEN_Pos           (16U)
#define CRM_AHBLPEN1_SRAMLPEN_Msk           (0x1U << CRM_AHBLPEN1_SRAMLPEN_Pos)     /*!< 0x00010000 */
#define CRM_AHBLPEN1_SRAMLPEN               CRM_AHBLPEN1_SRAMLPEN_Msk               /*!< SRAM clock enable in sleep mode */
#define CRM_AHBLPEN1_SRAM2LPEN_Pos           (17U)
#define CRM_AHBLPEN1_SRAM2LPEN_Msk           (0x1U << CRM_AHBLPEN1_SRAM2LPEN_Pos)   /*!< 0x00020000 */
#define CRM_AHBLPEN1_SRAM2LPEN               CRM_AHBLPEN1_SRAM2LPEN_Msk             /*!< SRAM2 clock enable in sleep mode */
#define CRM_AHBLPEN1_EDMALPEN_Pos           (21U)
#define CRM_AHBLPEN1_EDMALPEN_Msk           (0x1U << CRM_AHBLPEN1_EDMALPEN_Pos)     /*!< 0x00200000 */
#define CRM_AHBLPEN1_EDMALPEN               CRM_AHBLPEN1_EDMALPEN_Msk               /*!< EDMA clock enable in sleep mode */
#define CRM_AHBLPEN1_DMA1LPEN_Pos           (22U)
#define CRM_AHBLPEN1_DMA1LPEN_Msk           (0x1U << CRM_AHBLPEN1_DMA1LPEN_Pos)     /*!< 0x00400000 */
#define CRM_AHBLPEN1_DMA1LPEN               CRM_AHBLPEN1_DMA1LPEN_Msk               /*!< DMA1 clock enable in sleep mode */
#define CRM_AHBLPEN1_DMA2LPEN_Pos           (24U)
#define CRM_AHBLPEN1_DMA2LPEN_Msk           (0x1U << CRM_AHBLPEN1_DMA2LPEN_Pos)     /*!< 0x01000000 */
#define CRM_AHBLPEN1_DMA2LPEN               CRM_AHBLPEN1_DMA2LPEN_Msk               /*!< DMA2 clock enable in sleep mode */
#define CRM_AHBLPEN1_EMACLPEN_Pos           (25U)
#define CRM_AHBLPEN1_EMACLPEN_Msk           (0x1U << CRM_AHBLPEN1_EMACLPEN_Pos)     /*!< 0x02000000 */
#define CRM_AHBLPEN1_EMACLPEN               CRM_AHBLPEN1_EMACLPEN_Msk               /*!< EMAC clock enable in sleep mode */
#define CRM_AHBLPEN1_EMACTXLPEN_Pos         (26U)
#define CRM_AHBLPEN1_EMACTXLPEN_Msk         (0x1U << CRM_AHBLPEN1_EMACTXLPEN_Pos)   /*!< 0x04000000 */
#define CRM_AHBLPEN1_EMACTXLPEN             CRM_AHBLPEN1_EMACTXLPEN_Msk             /*!< EMACTX clock enable in sleep mode */
#define CRM_AHBLPEN1_EMACRXLPEN_Pos         (27U)
#define CRM_AHBLPEN1_EMACRXLPEN_Msk         (0x1U << CRM_AHBLPEN1_EMACRXLPEN_Pos)     /*!< 0x08000000 */
#define CRM_AHBLPEN1_EMACRXLPEN             CRM_AHBLPEN1_EMACRXLPEN_Msk               /*!< EMACRX clock enable in sleep mode */
#define CRM_AHBLPEN1_EMACPTPLPEN_Pos        (27U)
#define CRM_AHBLPEN1_EMACPTPLPEN_Msk        (0x1U << CRM_AHBLPEN1_EMACPTPLPEN_Pos)    /*!< 0x10000000 */
#define CRM_AHBLPEN1_EMACPTPLPEN            CRM_AHBLPEN1_EMACPTPLPEN_Msk              /*!< EMACPTP clock enable in sleep mode */
#define CRM_AHBLPEN1_OTGFS2LPEN_Pos         (29U)
#define CRM_AHBLPEN1_OTGFS2LPEN_Msk         (0x1U << CRM_AHBLPEN1_OTGFS2LPEN_Pos)    /*!< 0x20000000 */
#define CRM_AHBLPEN1_OTGFS2LPEN             CRM_AHBLPEN1_OTGFS2LPEN_Msk              /*!< OTGFS2 clock enable in sleep mode (F405 only) */

/*****************  Bit definition for CRM_AHBLPEN2 register  *****************/
#define CRM_AHBLPEN2_DVPLPEN_Pos            (0U)
#define CRM_AHBLPEN2_DVPLPEN_Msk            (0x1U << CRM_AHBLPEN2_DVPLPEN_Pos)      /*!< 0x00000001 */
#define CRM_AHBLPEN2_DVPLPEN                CRM_AHBLPEN2_DVPLPEN_Msk                /*!< DVP clock enable in sleep mode */
#define CRM_AHBLPEN2_OTGFSLPEN_Pos          (7U)
#define CRM_AHBLPEN2_OTGFSLPEN_Msk          (0x1U << CRM_AHBLPEN2_OTGFSLPEN_Pos)    /*!< 0x00008000 */
#define CRM_AHBLPEN2_OTGFSLPEN              CRM_AHBLPEN2_OTGFSLPEN_Msk              /*!< OTGFS clock enable in sleep mode */
#define CRM_AHBLPEN2_SDIO1LPEN_Pos          (15U)
#define CRM_AHBLPEN2_SDIO1LPEN_Msk          (0x1U << CRM_AHBLPEN2_SDIO1LPEN_Pos)    /*!< 0x00000080 */
#define CRM_AHBLPEN2_SDIO1LPEN              CRM_AHBLPEN2_SDIO1LPEN_Msk              /*!< SDIO1 clock enable in sleep mode */

/*****************  Bit definition for CRM_AHBLPEN3 register  *****************/
#define CRM_AHBLPEN3_XMCLPEN_Pos            (0U)
#define CRM_AHBLPEN3_XMCLPEN_Msk            (0x1U << CRM_AHBLPEN2_XMCLPEN_Pos)      /*!< 0x00000001 */
#define CRM_AHBLPEN3_XMCLPEN                CRM_AHBLPEN2_XMCLPEN_Msk                /*!< XMC clock enable in sleep mode */
#define CRM_AHBLPEN3_QSPI1LPEN_Pos          (1U)
#define CRM_AHBLPEN3_QSPI1LPEN_Msk          (0x1U << CRM_AHBLPEN3_QSPI1LPEN_Pos)    /*!< 0x00000002 */
#define CRM_AHBLPEN3_QSPI1LPEN              CRM_AHBLPEN3_QSPI1LPEN_Msk              /*!< QSPI1 clock enable in sleep mode */
#define CRM_AHBLPEN3_QSPI2LPEN_Pos          (14U)
#define CRM_AHBLPEN3_QSPI2LPEN_Msk          (0x1U << CRM_AHBLPEN3_QSPI2LPEN_Pos)    /*!< 0x00004000 */
#define CRM_AHBLPEN3_QSPI2LPEN              CRM_AHBLPEN3_QSPI2LPEN_Msk              /*!< QSPI2 clock enable in sleep mode */
#define CRM_AHBLPEN3_SDIO2LPEN_Pos          (15U)
#define CRM_AHBLPEN3_SDIO2LPEN_Msk          (0x1U << CRM_AHBLPEN2_SDIO2LPEN_Pos)    /*!< 0x00000080 */
#define CRM_AHBLPEN3_SDIO2LPEN              CRM_AHBLPEN2_SDIO2LPEN_Msk              /*!< SDIO2 clock enable in sleep mode */

