ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437zx.h
/*!< IOMC1 configuration */
#define GPIO_CFGR_IOMC1_Pos                 (2U)
#define GPIO_CFGR_IOMC1_Msk                 (0x3U << GPIO_CFGR_IOMC1_Pos)           /*!< 0x0000000C */
#define GPIO_CFGR_IOMC1                     GPIO_CFGR_IOMC1_Msk                     /*!< IOMC1[1:0] bits (GPIO x mode configuration, pin 1) */
#define GPIO_CFGR_IOMC1_0                   (0x1U << GPIO_CFGR_IOMC1_Pos)           /*!< 0x00000004 */
#define GPIO_CFGR_IOMC1_1                   (0x2U << GPIO_CFGR_IOMC1_Pos)           /*!< 0x00000008 */

/*!< IOMC2 configuration */
#define GPIO_CFGR_IOMC2_Pos                 (4U)
#define GPIO_CFGR_IOMC2_Msk                 (0x3U << GPIO_CFGR_IOMC2_Pos)           /*!< 0x00000030 */
#define GPIO_CFGR_IOMC2                     GPIO_CFGR_IOMC2_Msk                     /*!< IOMC2[1:0] bits (GPIO x mode configuration, pin 2) */
#define GPIO_CFGR_IOMC2_0                   (0x1U << GPIO_CFGR_IOMC2_Pos)           /*!< 0x00000010 */
#define GPIO_CFGR_IOMC2_1                   (0x2U << GPIO_CFGR_IOMC2_Pos)           /*!< 0x00000020 */

/*!< IOMC3 configuration */
#define GPIO_CFGR_IOMC3_Pos                 (6U)
#define GPIO_CFGR_IOMC3_Msk                 (0x3U << GPIO_CFGR_IOMC3_Pos)           /*!< 0x000000C0 */
#define GPIO_CFGR_IOMC3                     GPIO_CFGR_IOMC3_Msk                     /*!< IOMC3[1:0] bits (GPIO x mode configuration, pin 3) */
#define GPIO_CFGR_IOMC3_0                   (0x1U << GPIO_CFGR_IOMC3_Pos)           /*!< 0x00000040 */
#define GPIO_CFGR_IOMC3_1                   (0x2U << GPIO_CFGR_IOMC3_Pos)           /*!< 0x00000080 */

/*!< IOMC4 configuration */
#define GPIO_CFGR_IOMC4_Pos                 (8U)
#define GPIO_CFGR_IOMC4_Msk                 (0x3U << GPIO_CFGR_IOMC4_Pos)           /*!< 0x00000300 */
#define GPIO_CFGR_IOMC4                     GPIO_CFGR_IOMC4_Msk                     /*!< IOMC4[1:0] bits (GPIO x mode configuration, pin 4) */
#define GPIO_CFGR_IOMC4_0                   (0x1U << GPIO_CFGR_IOMC4_Pos)           /*!< 0x00000100 */
#define GPIO_CFGR_IOMC4_1                   (0x2U << GPIO_CFGR_IOMC4_Pos)           /*!< 0x00000200 */

/*!< IOMC5 configuration */
#define GPIO_CFGR_IOMC5_Pos                 (10U)
#define GPIO_CFGR_IOMC5_Msk                 (0x3U << GPIO_CFGR_IOMC5_Pos)           /*!< 0x00000C00 */
#define GPIO_CFGR_IOMC5                     GPIO_CFGR_IOMC5_Msk                     /*!< IOMC5[1:0] bits (GPIO x mode configuration, pin 5) */
#define GPIO_CFGR_IOMC5_0                   (0x1U << GPIO_CFGR_IOMC5_Pos)           /*!< 0x00000400 */
#define GPIO_CFGR_IOMC5_1                   (0x2U << GPIO_CFGR_IOMC5_Pos)           /*!< 0x00000800 */

/*!< IOMC6 configuration */
#define GPIO_CFGR_IOMC6_Pos                 (12U)
#define GPIO_CFGR_IOMC6_Msk                 (0x3U << GPIO_CFGR_IOMC6_Pos)           /*!< 0x00003000 */
#define GPIO_CFGR_IOMC6                     GPIO_CFGR_IOMC6_Msk                     /*!< IOMC6[1:0] bits (GPIO x mode configuration, pin 6) */
#define GPIO_CFGR_IOMC6_0                   (0x1U << GPIO_CFGR_IOMC6_Pos)           /*!< 0x00001000 */
#define GPIO_CFGR_IOMC6_1                   (0x2U << GPIO_CFGR_IOMC6_Pos)           /*!< 0x00002000 */

/*!< IOMC7 configuration */
#define GPIO_CFGR_IOMC7_Pos                 (14U)
#define GPIO_CFGR_IOMC7_Msk                 (0x3U << GPIO_CFGR_IOMC7_Pos)           /*!< 0x0000C000 */
#define GPIO_CFGR_IOMC7                     GPIO_CFGR_IOMC7_Msk                     /*!< IOMC7[1:0] bits (GPIO x mode configuration, pin 7) */
#define GPIO_CFGR_IOMC7_0                   (0x1U << GPIO_CFGR_IOMC7_Pos)           /*!< 0x00004000 */
#define GPIO_CFGR_IOMC7_1                   (0x2U << GPIO_CFGR_IOMC7_Pos)           /*!< 0x00008000 */

/*!< IOMC8 configuration */
#define GPIO_CFGR_IOMC8_Pos                 (16U)
#define GPIO_CFGR_IOMC8_Msk                 (0x3U << GPIO_CFGR_IOMC8_Pos)           /*!< 0x00030000 */
#define GPIO_CFGR_IOMC8                     GPIO_CFGR_IOMC8_Msk                     /*!< IOMC8[1:0] bits (GPIO x mode configuration, pin 8) */
#define GPIO_CFGR_IOMC8_0                   (0x1U << GPIO_CFGR_IOMC8_Pos)           /*!< 0x00010000 */
#define GPIO_CFGR_IOMC8_1                   (0x2U << GPIO_CFGR_IOMC8_Pos)           /*!< 0x00020000 */

/*!< IOMC9 configuration */
#define GPIO_CFGR_IOMC9_Pos                 (18U)
#define GPIO_CFGR_IOMC9_Msk                 (0x3U << GPIO_CFGR_IOMC9_Pos)           /*!< 0x000C0000 */
#define GPIO_CFGR_IOMC9                     GPIO_CFGR_IOMC9_Msk                     /*!< IOMC9[1:0] bits (GPIO x mode configuration, pin 9) */
#define GPIO_CFGR_IOMC9_0                   (0x1U << GPIO_CFGR_IOMC9_Pos)           /*!< 0x00040000 */
#define GPIO_CFGR_IOMC9_1                   (0x2U << GPIO_CFGR_IOMC9_Pos)           /*!< 0x00080000 */

/*!< IOMC10 configuration */
#define GPIO_CFGR_IOMC10_Pos                (20U)
#define GPIO_CFGR_IOMC10_Msk                (0x3U << GPIO_CFGR_IOMC10_Pos)          /*!< 0x00300000 */
#define GPIO_CFGR_IOMC10                    GPIO_CFGR_IOMC10_Msk                    /*!< IOMC10[1:0] bits (GPIO x mode configuration, pin 10) */
#define GPIO_CFGR_IOMC10_0                  (0x1U << GPIO_CFGR_IOMC10_Pos)          /*!< 0x00100000 */
#define GPIO_CFGR_IOMC10_1                  (0x2U << GPIO_CFGR_IOMC10_Pos)          /*!< 0x00200000 */

/*!< IOMC11 configuration */
#define GPIO_CFGR_IOMC11_Pos                (22U)
#define GPIO_CFGR_IOMC11_Msk                (0x3U << GPIO_CFGR_IOMC11_Pos)          /*!< 0x00C00000 */
#define GPIO_CFGR_IOMC11                    GPIO_CFGR_IOMC11_Msk                    /*!< IOMC11[1:0] bits (GPIO x mode configuration, pin 11) */
#define GPIO_CFGR_IOMC11_0                  (0x1U << GPIO_CFGR_IOMC11_Pos)          /*!< 0x00400000 */
#define GPIO_CFGR_IOMC11_1                  (0x2U << GPIO_CFGR_IOMC11_Pos)          /*!< 0x00800000 */

/*!< IOMC12 configuration */
#define GPIO_CFGR_IOMC12_Pos                (24U)
#define GPIO_CFGR_IOMC12_Msk                (0x3U << GPIO_CFGR_IOMC12_Pos)          /*!< 0x03000000 */
#define GPIO_CFGR_IOMC12                    GPIO_CFGR_IOMC12_Msk                    /*!< IOMC12[1:0] bits (GPIO x mode configuration, pin 12) */
#define GPIO_CFGR_IOMC12_0                  (0x1U << GPIO_CFGR_IOMC12_Pos)          /*!< 0x01000000 */
#define GPIO_CFGR_IOMC12_1                  (0x2U << GPIO_CFGR_IOMC12_Pos)          /*!< 0x02000000 */

/*!< IOMC13 configuration */
#define GPIO_CFGR_IOMC13_Pos                (26U)
#define GPIO_CFGR_IOMC13_Msk                (0x3U << GPIO_CFGR_IOMC13_Pos)          /*!< 0x0C000000 */
#define GPIO_CFGR_IOMC13                    GPIO_CFGR_IOMC13_Msk                    /*!< IOMC13[1:0] bits (GPIO x mode configuration, pin 13) */
#define GPIO_CFGR_IOMC13_0                  (0x1U << GPIO_CFGR_IOMC13_Pos)          /*!< 0x04000000 */
#define GPIO_CFGR_IOMC13_1                  (0x2U << GPIO_CFGR_IOMC13_Pos)          /*!< 0x08000000 */

/*!< IOMC14 configuration */
#define GPIO_CFGR_IOMC14_Pos                (28U)
#define GPIO_CFGR_IOMC14_Msk                (0x3U << GPIO_CFGR_IOMC14_Pos)          /*!< 0x30000000 */
#define GPIO_CFGR_IOMC14                    GPIO_CFGR_IOMC14_Msk                    /*!< IOMC14[1:0] bits (GPIO x mode configuration, pin 14) */
#define GPIO_CFGR_IOMC14_0                  (0x1U << GPIO_CFGR_IOMC14_Pos)          /*!< 0x10000000 */
#define GPIO_CFGR_IOMC14_1                  (0x2U << GPIO_CFGR_IOMC14_Pos)          /*!< 0x20000000 */

