ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437zx.h
#define SCFG_CFG2_MII_RMII_SEL_Pos          (23U)
#define SCFG_CFG2_MII_RMII_SEL_Msk          (0x1U << SCFG_CFG2_MII_RMII_SEL_Pos)     /*!< 0x00800020 */
#define SCFG_CFG2_MII_RMII_SEL              SCFG_CFG2_MII_RMII_SEL_Msk               /*!< mii rmii selection */


/*****************  Bit definition for SCFG_EXINTC1 register  *****************/
/*!< EXINT0 configuration */
#define SCFG_EXINTC1_EXINT0_Pos             (0U)
#define SCFG_EXINTC1_EXINT0_Msk             (0xFU << SCFG_EXINTC1_EXINT0_Pos)       /*!< 0x0000000F */
#define SCFG_EXINTC1_EXINT0                 SCFG_EXINTC1_EXINT0_Msk                 /*!< EXINT0[3:0] bits (EXINT0 input source configuration) */

#define SCFG_EXINTC1_EXINT0_GPA             0x00000000U                             /*!< GPIOA pin 0 */
#define SCFG_EXINTC1_EXINT0_GPB_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT0_GPB_Pos)   /*!< 0x00000001 */
#define SCFG_EXINTC1_EXINT0_GPB             SCFG_EXINTC1_EXINT0_GPB_Msk             /*!< GPIOB pin 0 */
#define SCFG_EXINTC1_EXINT0_GPC_Pos         (1U)
#define SCFG_EXINTC1_EXINT0_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT0_GPC_Pos)   /*!< 0x00000002 */
#define SCFG_EXINTC1_EXINT0_GPC             SCFG_EXINTC1_EXINT0_GPC_Msk             /*!< GPIOC pin 0 */
#define SCFG_EXINTC1_EXINT0_GPD_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT0_GPD_Pos)   /*!< 0x00000003 */
#define SCFG_EXINTC1_EXINT0_GPD             SCFG_EXINTC1_EXINT0_GPD_Msk             /*!< GPIOD pin 0 */
#define SCFG_EXINTC1_EXINT0_GPE_Pos         (2U)
#define SCFG_EXINTC1_EXINT0_GPE_Msk         (0x1U << SCFG_EXINTC1_EXINT0_GPE_Pos)   /*!< 0x00000004 */
#define SCFG_EXINTC1_EXINT0_GPE             SCFG_EXINTC1_EXINT0_GPE_Msk             /*!< GPIOE pin 0 */
#define SCFG_EXINTC1_EXINT0_GPF_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPF_Msk         (0x5U << SCFG_EXINTC1_EXINT0_GPF_Pos)   /*!< 0x00000005 */
#define SCFG_EXINTC1_EXINT0_GPF             SCFG_EXINTC1_EXINT0_GPF_Msk             /*!< GPIOF pin 0 */
#define SCFG_EXINTC1_EXINT0_GPG_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPG_Msk         (0x6U << SCFG_EXINTC1_EXINT0_GPG_Pos)   /*!< 0x00000006 */
#define SCFG_EXINTC1_EXINT0_GPG             SCFG_EXINTC1_EXINT0_GPG_Msk             /*!< GPIOG pin 0 */
#define SCFG_EXINTC1_EXINT0_GPH_Pos         (0U)
#define SCFG_EXINTC1_EXINT0_GPH_Msk         (0x7U << SCFG_EXINTC1_EXINT0_GPH_Pos)   /*!< 0x00000007 */
#define SCFG_EXINTC1_EXINT0_GPH             SCFG_EXINTC1_EXINT0_GPH_Msk             /*!< GPIOH pin 0 */

/*!< EXINT1 configuration */
#define SCFG_EXINTC1_EXINT1_Pos             (4U)
#define SCFG_EXINTC1_EXINT1_Msk             (0xFU << SCFG_EXINTC1_EXINT1_Pos)       /*!< 0x000000F0 */
#define SCFG_EXINTC1_EXINT1                 SCFG_EXINTC1_EXINT1_Msk                 /*!< EXINT1[3:0] bits (EXINT1 input source configuration) */

#define SCFG_EXINTC1_EXINT1_GPA             0x00000000U                             /*!< GPIOA pin 1 */
#define SCFG_EXINTC1_EXINT1_GPB_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT1_GPB_Pos)   /*!< 0x00000010 */
#define SCFG_EXINTC1_EXINT1_GPB             SCFG_EXINTC1_EXINT1_GPB_Msk             /*!< GPIOB pin 1 */
#define SCFG_EXINTC1_EXINT1_GPC_Pos         (5U)
#define SCFG_EXINTC1_EXINT1_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT1_GPC_Pos)   /*!< 0x00000020 */
#define SCFG_EXINTC1_EXINT1_GPC             SCFG_EXINTC1_EXINT1_GPC_Msk             /*!< GPIOC pin 1 */
#define SCFG_EXINTC1_EXINT1_GPD_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT1_GPD_Pos)   /*!< 0x00000030 */
#define SCFG_EXINTC1_EXINT1_GPD             SCFG_EXINTC1_EXINT1_GPD_Msk             /*!< GPIOD pin 1 */
#define SCFG_EXINTC1_EXINT1_GPE_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPE_Msk         (0x4U << SCFG_EXINTC1_EXINT1_GPE_Pos)   /*!< 0x00000040 */
#define SCFG_EXINTC1_EXINT1_GPE             SCFG_EXINTC1_EXINT1_GPE_Msk             /*!< GPIOE pin 1 */
#define SCFG_EXINTC1_EXINT1_GPF_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPF_Msk         (0x5U << SCFG_EXINTC1_EXINT1_GPF_Pos)   /*!< 0x00000050 */
#define SCFG_EXINTC1_EXINT1_GPF             SCFG_EXINTC1_EXINT1_GPF_Msk             /*!< GPIOF pin 1 */
#define SCFG_EXINTC1_EXINT1_GPG_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPG_Msk         (0x6U << SCFG_EXINTC1_EXINT1_GPG_Pos)   /*!< 0x00000060 */
#define SCFG_EXINTC1_EXINT1_GPG             SCFG_EXINTC1_EXINT1_GPG_Msk             /*!< GPIOG pin 1 */
#define SCFG_EXINTC1_EXINT1_GPH_Pos         (4U)
#define SCFG_EXINTC1_EXINT1_GPH_Msk         (0x7U << SCFG_EXINTC1_EXINT1_GPH_Pos)   /*!< 0x00000060 */
#define SCFG_EXINTC1_EXINT1_GPH             SCFG_EXINTC1_EXINT1_GPH_Msk             /*!< GPIOH pin 1 */

/*!< EXINT2 configuration */
#define SCFG_EXINTC1_EXINT2_Pos             (8U)
#define SCFG_EXINTC1_EXINT2_Msk             (0xFU << SCFG_EXINTC1_EXINT2_Pos)       /*!< 0x00000F00 */
#define SCFG_EXINTC1_EXINT2                 SCFG_EXINTC1_EXINT2_Msk                 /*!< EXINT2[3:0] bits (EXINT2 input source configuration) */

#define SCFG_EXINTC1_EXINT2_GPA             0x00000000U                             /*!< GPIOA pin 2 */
#define SCFG_EXINTC1_EXINT2_GPB_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT2_GPB_Pos)   /*!< 0x00000100 */
#define SCFG_EXINTC1_EXINT2_GPB             SCFG_EXINTC1_EXINT2_GPB_Msk             /*!< GPIOB pin 2 */
#define SCFG_EXINTC1_EXINT2_GPC_Pos         (9U)
#define SCFG_EXINTC1_EXINT2_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT2_GPC_Pos)   /*!< 0x00000200 */
#define SCFG_EXINTC1_EXINT2_GPC             SCFG_EXINTC1_EXINT2_GPC_Msk             /*!< GPIOC pin 2 */
#define SCFG_EXINTC1_EXINT2_GPD_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT2_GPD_Pos)   /*!< 0x00000300 */
#define SCFG_EXINTC1_EXINT2_GPD             SCFG_EXINTC1_EXINT2_GPD_Msk             /*!< GPIOD pin 2 */
#define SCFG_EXINTC1_EXINT2_GPE_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPE_Msk         (0x4U << SCFG_EXINTC1_EXINT2_GPE_Pos)   /*!< 0x00000400 */
#define SCFG_EXINTC1_EXINT2_GPE             SCFG_EXINTC1_EXINT2_GPE_Msk             /*!< GPIOE pin 2 */
#define SCFG_EXINTC1_EXINT2_GPF_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPF_Msk         (0x5U << SCFG_EXINTC1_EXINT2_GPF_Pos)   /*!< 0x00000500 */
#define SCFG_EXINTC1_EXINT2_GPF             SCFG_EXINTC1_EXINT2_GPF_Msk             /*!< GPIOF pin 2 */
#define SCFG_EXINTC1_EXINT2_GPG_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPG_Msk         (0x6U << SCFG_EXINTC1_EXINT2_GPG_Pos)   /*!< 0x00000600 */
#define SCFG_EXINTC1_EXINT2_GPG             SCFG_EXINTC1_EXINT2_GPG_Msk             /*!< GPIOG pin 2 */
#define SCFG_EXINTC1_EXINT2_GPH_Pos         (8U)
#define SCFG_EXINTC1_EXINT2_GPH_Msk         (0x7U << SCFG_EXINTC1_EXINT2_GPH_Pos)   /*!< 0x00000700 */
#define SCFG_EXINTC1_EXINT2_GPH             SCFG_EXINTC1_EXINT2_GPH_Msk             /*!< GPIOH pin 2 */

/*!< EXINT3 configuration */
#define SCFG_EXINTC1_EXINT3_Pos             (12U)
#define SCFG_EXINTC1_EXINT3_Msk             (0xFU << SCFG_EXINTC1_EXINT3_Pos)       /*!< 0x0000F000 */
#define SCFG_EXINTC1_EXINT3                 SCFG_EXINTC1_EXINT3_Msk                 /*!< EXINT3[3:0] bits (EXINT3 input source configuration) */

#define SCFG_EXINTC1_EXINT3_GPA             0x00000000U                             /*!< GPIOA pin 3 */
#define SCFG_EXINTC1_EXINT3_GPB_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPB_Msk         (0x1U << SCFG_EXINTC1_EXINT3_GPB_Pos)   /*!< 0x00001000 */
#define SCFG_EXINTC1_EXINT3_GPB             SCFG_EXINTC1_EXINT3_GPB_Msk             /*!< GPIOB pin 3 */
#define SCFG_EXINTC1_EXINT3_GPC_Pos         (13U)
#define SCFG_EXINTC1_EXINT3_GPC_Msk         (0x1U << SCFG_EXINTC1_EXINT3_GPC_Pos)   /*!< 0x00002000 */
#define SCFG_EXINTC1_EXINT3_GPC             SCFG_EXINTC1_EXINT3_GPC_Msk             /*!< GPIOC pin 3 */
#define SCFG_EXINTC1_EXINT3_GPD_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPD_Msk         (0x3U << SCFG_EXINTC1_EXINT3_GPD_Pos)   /*!< 0x00003000 */
#define SCFG_EXINTC1_EXINT3_GPD             SCFG_EXINTC1_EXINT3_GPD_Msk             /*!< GPIOD pin 3 */
#define SCFG_EXINTC1_EXINT3_GPE_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPE_Msk         (0x4U << SCFG_EXINTC1_EXINT3_GPE_Pos)   /*!< 0x00004000 */
#define SCFG_EXINTC1_EXINT3_GPE             SCFG_EXINTC1_EXINT3_GPE_Msk             /*!< GPIOE pin 3 */
#define SCFG_EXINTC1_EXINT3_GPF_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPF_Msk         (0x5U << SCFG_EXINTC1_EXINT3_GPF_Pos)   /*!< 0x00005000 */
#define SCFG_EXINTC1_EXINT3_GPF             SCFG_EXINTC1_EXINT3_GPF_Msk             /*!< GPIOF pin 3 */
#define SCFG_EXINTC1_EXINT3_GPG_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPG_Msk         (0x6U << SCFG_EXINTC1_EXINT3_GPG_Pos)   /*!< 0x00006000 */
#define SCFG_EXINTC1_EXINT3_GPG             SCFG_EXINTC1_EXINT3_GPG_Msk             /*!< GPIOG pin 3 */
#define SCFG_EXINTC1_EXINT3_GPH_Pos         (12U)
#define SCFG_EXINTC1_EXINT3_GPH_Msk         (0x7U << SCFG_EXINTC1_EXINT3_GPH_Pos)   /*!< 0x00007000 */
#define SCFG_EXINTC1_EXINT3_GPH             SCFG_EXINTC1_EXINT3_GPH_Msk             /*!< GPIOH pin 3 */

/*****************  Bit definition for SCFG_EXINTC2 register  *****************/
/*!< EXINT4 configuration */
#define SCFG_EXINTC2_EXINT4_Pos             (0U)
#define SCFG_EXINTC2_EXINT4_Msk             (0xFU << SCFG_EXINTC2_EXINT4_Pos)       /*!< 0x0000000F */
#define SCFG_EXINTC2_EXINT4                 SCFG_EXINTC2_EXINT4_Msk                 /*!< EXINT4[3:0] bits (EXINT4 input source configuration) */

#define SCFG_EXINTC2_EXINT4_GPA             0x00000000U                             /*!< GPIOA pin 4 */
#define SCFG_EXINTC2_EXINT4_GPB_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPB_Msk         (0x1U << SCFG_EXINTC2_EXINT4_GPB_Pos)   /*!< 0x00000001 */
#define SCFG_EXINTC2_EXINT4_GPB             SCFG_EXINTC2_EXINT4_GPB_Msk             /*!< GPIOB pin 4 */
#define SCFG_EXINTC2_EXINT4_GPC_Pos         (1U)
#define SCFG_EXINTC2_EXINT4_GPC_Msk         (0x1U << SCFG_EXINTC2_EXINT4_GPC_Pos)   /*!< 0x00000002 */
#define SCFG_EXINTC2_EXINT4_GPC             SCFG_EXINTC2_EXINT4_GPC_Msk             /*!< GPIOC pin 4 */
#define SCFG_EXINTC2_EXINT4_GPD_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPD_Msk         (0x3U << SCFG_EXINTC2_EXINT4_GPD_Pos)   /*!< 0x00000003 */
#define SCFG_EXINTC2_EXINT4_GPD             SCFG_EXINTC2_EXINT4_GPD_Msk             /*!< GPIOD pin 4 */
#define SCFG_EXINTC2_EXINT4_GPE_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPE_Msk         (0x4U << SCFG_EXINTC2_EXINT4_GPE_Pos)   /*!< 0x00000004 */
#define SCFG_EXINTC2_EXINT4_GPE             SCFG_EXINTC2_EXINT4_GPE_Msk             /*!< GPIOE pin 4 */
#define SCFG_EXINTC2_EXINT4_GPF_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPF_Msk         (0x5U << SCFG_EXINTC2_EXINT4_GPF_Pos)   /*!< 0x00000005 */
#define SCFG_EXINTC2_EXINT4_GPF             SCFG_EXINTC2_EXINT4_GPF_Msk             /*!< GPIOF pin 4 */
#define SCFG_EXINTC2_EXINT4_GPG_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPG_Msk         (0x6U << SCFG_EXINTC2_EXINT4_GPG_Pos)   /*!< 0x00000006 */
#define SCFG_EXINTC2_EXINT4_GPG             SCFG_EXINTC2_EXINT4_GPG_Msk             /*!< GPIOG pin 4 */
#define SCFG_EXINTC2_EXINT4_GPH_Pos         (0U)
#define SCFG_EXINTC2_EXINT4_GPH_Msk         (0x7U << SCFG_EXINTC2_EXINT4_GPH_Pos)   /*!< 0x00000007 */
#define SCFG_EXINTC2_EXINT4_GPH             SCFG_EXINTC2_EXINT4_GPH_Msk             /*!< GPIOH pin 4 */

/* EXINT5 configuration */
#define SCFG_EXINTC2_EXINT5_Pos             (4U)
#define SCFG_EXINTC2_EXINT5_Msk             (0xFU << SCFG_EXINTC2_EXINT5_Pos)       /*!< 0x000000F0 */
#define SCFG_EXINTC2_EXINT5                 SCFG_EXINTC2_EXINT5_Msk                 /*!< EXINT5[3:0] bits (EXINT5 input source configuration) */

#define SCFG_EXINTC2_EXINT5_GPA             0x00000000U                             /*!< GPIOA pin 5 */
#define SCFG_EXINTC2_EXINT5_GPB_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPB_Msk         (0x1U << SCFG_EXINTC2_EXINT5_GPB_Pos)   /*!< 0x00000010 */
#define SCFG_EXINTC2_EXINT5_GPB             SCFG_EXINTC2_EXINT5_GPB_Msk             /*!< GPIOB pin 5 */
#define SCFG_EXINTC2_EXINT5_GPC_Pos         (5U)
#define SCFG_EXINTC2_EXINT5_GPC_Msk         (0x1U << SCFG_EXINTC2_EXINT5_GPC_Pos)   /*!< 0x00000020 */
#define SCFG_EXINTC2_EXINT5_GPC             SCFG_EXINTC2_EXINT5_GPC_Msk             /*!< GPIOC pin 5 */
#define SCFG_EXINTC2_EXINT5_GPD_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPD_Msk         (0x3U << SCFG_EXINTC2_EXINT5_GPD_Pos)   /*!< 0x00000030 */
#define SCFG_EXINTC2_EXINT5_GPD             SCFG_EXINTC2_EXINT5_GPD_Msk             /*!< GPIOD pin 5 */
#define SCFG_EXINTC2_EXINT5_GPE_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPE_Msk         (0x4U << SCFG_EXINTC2_EXINT5_GPE_Pos)   /*!< 0x00000040 */
#define SCFG_EXINTC2_EXINT5_GPE             SCFG_EXINTC2_EXINT5_GPE_Msk             /*!< GPIOD pin 5 */
#define SCFG_EXINTC2_EXINT5_GPF_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPF_Msk         (0x5U << SCFG_EXINTC2_EXINT5_GPF_Pos)   /*!< 0x00000050 */
#define SCFG_EXINTC2_EXINT5_GPF             SCFG_EXINTC2_EXINT5_GPF_Msk             /*!< GPIOF pin 5 */
#define SCFG_EXINTC2_EXINT5_GPG_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPG_Msk         (0x6U << SCFG_EXINTC2_EXINT5_GPG_Pos)   /*!< 0x00000060 */
#define SCFG_EXINTC2_EXINT5_GPG             SCFG_EXINTC2_EXINT5_GPG_Msk             /*!< GPIOF pin 5 */
#define SCFG_EXINTC2_EXINT5_GPH_Pos         (4U)
#define SCFG_EXINTC2_EXINT5_GPH_Msk         (0x7U << SCFG_EXINTC2_EXINT5_GPH_Pos)   /*!< 0x00000070 */
#define SCFG_EXINTC2_EXINT5_GPH             SCFG_EXINTC2_EXINT5_GPH_Msk             /*!< GPIOF pin 5 */

/*!< EXINT6 configuration */
#define SCFG_EXINTC2_EXINT6_Pos             (8U)
#define SCFG_EXINTC2_EXINT6_Msk             (0xFU << SCFG_EXINTC2_EXINT6_Pos)       /*!< 0x00000F00 */
#define SCFG_EXINTC2_EXINT6                 SCFG_EXINTC2_EXINT6_Msk                 /*!< EXINT6[3:0] bits (EXINT6 input source configuration) */

